app/controllers/tasks_controller.rb

    task = Task.find_by(id: params[:id])

    if task.completed_at == "Incomplete"
      task.completed_at = "Complete"
      task.completion_date = Time.now.strftime("%F %T")
      task.update(completed_at: task.completed_at)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed_at" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completed_at", "Complete"], ["completion_date", "2019-04-13 18:02:15"], ["updated_at", "2019-04-14 01:02:15.218184"], ["id", 2]]