app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" ASC

  def show
    task_id = params[:id]
    @task = Task.find_by(id: task_id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    task = Task.new(task_params)

    is_successful = task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Call Ma"], ["description", "Fam First"], ["created_at", "2019-04-12 20:32:53.107804"], ["updated_at", "2019-04-12 20:32:53.107804"]]

  def edit
    @task = Task.find_by(id: params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    task = Task.find_by(id: params[:id])

    is_successful = task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "Mommy wants to hear from me!!!"], ["updated_at", "2019-04-12 21:05:36.947310"], ["id", 8]]

    task = Task.find_by(id: params[:id])
    if task.completed_at = "Incomplete"
      task.completed_at = "Complete"
      task.completion_date = Time.now.strftime("%F %T")
      task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed_at" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completed_at", "Complete"], ["completion_date", "2019-04-13 15:06:15 -0700"], ["updated_at", "2019-04-13 22:06:15.011212"], ["id", 1]]

    task = Task.find_by(id: params[:id])
    if task.completed_at = "Complete"
      task.completed_at = "Incomplete"
      task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed_at" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed_at", "Incomplete"], ["updated_at", "2019-04-13 22:00:45.376661"], ["id", 1]]

    task = Task.find_by(id: params[:id])

    if task.nil?
      head :not_found
    else
      task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]

  def verify
    @task = Task.find_by(id: params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]